Tekla Open API Reference for Tekla Structures 2025
ConicalSurfaceNode Properties
The ConicalSurfaceNode type exposes the following members.
Properties
Name | Description
IsAutomatic
 Gets a value indicating whether this geometry node was automatically generated (returns false if it was originally a user-defined part)
 (Inherited from BendSurfaceNode.)
Surface
 Gets the conical surface geometry.
Top
See Also
Reference
ConicalSurfaceNode Class
Tekla.Structures.Model Namespace